Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-7_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: Introduction
ja: はじめに

source: Imagine we meet at a party.
ja: 想像してみてください。私たちはパーティーで出会いました。

source: Not long into conversation you ask me what I do.
ja: 会話を始めて間もなく、あなたが私の職業を尋ねます。

source: I simply say, “I’m a designer.” Before you have the chance to ask me what type of designer I am, our mutual friend, the host, taps me on the elbow.
ja: 私は一言、「デザイナーです」と答えます。何のデザイナーなのか、あなたが聞く前に、2人の共通の友人であるホストが私を肘で突きます。

source: “Can I borrow you a moment?”
ja: 「ちょっといいかな？」

source: They make their apologies and usher me away.
ja: 彼はあなたにわびを言うと、私を連れていってしまいました。

source: You’re rather relieved, actually, since the sort of person who proudly pronounces themselves “a designer” is probably a bit of a self-regarding bore.
ja: あなたは正直、少しほっとします。なぜなら、得意げに「デザイナー」を名乗るタイプの人はたいてい、ちょっと自尊心の高い退屈な人だからです。

source: Nonetheless, you’re left briefly wondering what I actually do to pay the bills.
ja: それでもあなたはしばらくの間、私の仕事について思いを巡らせます。

source: Perhaps he makes designer egg cups?
ja: ブランドもののゆで卵立てをデザインしているのかな？

source: Sews postmodernist swimwear?
ja: それとも最先端の水着を縫っているとか？

source: Builds helicopter missile systems?
ja: ヘリコプターのミサイルシステムを作っていたりして？

source: He could have meant anything.
ja: 一口にデザイナーと言っても実にさまざまです。

source: By the end of the party we’re not reacquainted, but in a conversation with our mutual friend over the phone the following day, they apologize to you again for the previous night’s interruption.
ja: それからパーティーが終わるまで、私たちが再会することはありませんでしたが、翌日、あなたはさっきの友人と電話で話しているときに、前夜は会話を中断させて申し訳なかったと再び謝罪されます。

source: After a moment, you recall.
ja: そして、しばらく考えてから思い出します。

source: “Oh, your friend the designer.
ja: 「ああ、デザイナーのお友達ね。

source: Well, never mind.
ja: いいよ、気にしないで。

source: What does he actually design anyway?”
ja: それはそうと、彼はいったい何をデザインしているの？」

source: “Oh, he’s a web designer.”
ja: 「彼はWebデザイナーだよ」

source: “Oh, right.”
ja: 「へえ、そうなんだ」

source: “Yeah.”
ja: 「うん」

source: Now, the way you might react to this new information is really going to depend on your relationship to the sprawling, amorphous public information matrix we call The Web.
ja: この新情報に対するあなたの反応は、「Web」という無秩序に広がる、形の定まらない公共の情報基盤とあなたの関係によって大きく違ってきます。

source: If you’re more a consumer of the web than a producer for the web, web designer is probably sufficient: “OK, so they design web stuff.
ja: もしあなたがWebを作る側ではなく利用する側の人間なら、おそらくWebデザイナーという答えで納得するでしょう。

source: Websites and the like.”
ja: 「なるほど、Webサイトなんかをデザインしているわけね」。

source: But I’m willing to bet this isn’t you, otherwise you wouldn’t be reading this book.
ja: でも、皆さんは違いますよね？利用する側の人はこの本は読まないでしょうから。

source: In which case, you’re no doubt aware just how controversial, contested, and frequently contrary the term design is in the context of the web.
ja: Webを作る側の人間ならきっと、Webという文脈において「デザイン」という言葉がいかに物議を醸し、たいていの場合は歩み寄りが見られないまま論争が決裂してしまうことはご存じでしょう。

source: The number of people contributing to the web at any given moment is unfathomable, and so is the variety of their talents and skills.
ja: Webにどこかの段階で寄与している人の数は計り知れません。その人たちの才能やスキルも実にさまざまです。

source: So which ones are the designers, and what do they do?
ja: では、いったいその中の誰がデザイナーなのでしょうか？デザイナーとは何をする人なのでしょうか？

source: For a long time, we’ve been getting the answers to these questions epically, tragicomically wrong.
ja: 私たちは長い間、これらの疑問の答えを叙事詩的、悲喜劇的に間違い続けてきました。

source: We’ve misconceived and mistreated the medium, both making hard work for ourselves and shortchanging our audiences as a result.
ja: このメディアを誤解して不当に扱い、結果、自らの仕事を大変にして、ユーザーのことも不当に扱い続けてきたのです。

source: Reconceiving Web Design
ja: Webデザインを考え直す

source: Our most persistent error as an industry has been to apply the largely incompatible principles of printed graphical communication design to the web.
ja: 業界における最も根深い間違いは、Webに、まったく相容れない印刷物のグラフィックコミュニケーションデザインの原則を当てはめてしまっていることです。

source: A print designer’s domain is purely visual, confined to predictable and predetermined spaces, using agreed materials and consistently reproducible resolutions and colors.
ja: 印刷物のデザイナーの領域は純粋に視覚的なものです。既定あるいは予測可能なスペースの中で、決められた素材と、確実に再現できる解像度や色を使用します。

source: Print design is the production of static, immutable artifacts.
ja: 印刷物デザインとは、静的で不変のものを作ることです。

source: That’s not like the web at all, but it doesn’t stop us pouring wasted energy into pointless frippery like pixel perfection and organizing ourselves into those two ill-defined, arbitrary groups, designers and developers.
ja: このように印刷物とWebはまったく違うのに、我々はピクセルパーフェクトといった無意味でくだらないことに無駄なエネルギーを注ぎ、自身をデザイナーと開発者という、自分たちで勝手に定めた曖昧な2つのグループに分類することをやめられないでいます。

source: It’s as if content editors and project managers don’t even exist!
ja: コンテンツエディターやプロジェクトマネージャはどこに行ってしまったんだという話です。

source: The truth is, design work is deliberation.
ja: デザインとは本来、熟考することです。

source: It’s the pursuit of the best solution to a given problem.
ja: 与えられた課題のベストな解決策を追求することです。

source: By relegating design to the realm of visual aesthetics, so much of the web goes undesigned.
ja: それを「見た目の美しさ」という領域に格下げすることで、大半のWebは本当の意味でのデザイン性を失っています。

source: This can only lead to inaccessibility, poor performance and, of course, a general lack of utility.
ja: これではアクセシブルとは言えない、パフォーマンスも貧弱な、そしてもちろん全般的に有用性に欠けるWebしか生まれません。

source: The aim of this book is to help you nurture design thinking that’s suited to the web and, as such, acknowledges some (astonishingly recent!) developments in the evolution of the web design discipline:
ja: 本書の目的は、皆さんがWebに適したデザイン思考を養うお手伝いをすることと、そしてWebデザイン分野の進化における（思いのほか最近の）発展を認識することです。

source: •The web is made of code and must be designed, therefore designing with code is working with the right materials.
ja: Webはコードでできており、デザインが欠かせない。したがって、コードによるデザインは、適切な素材を使って作業する。

source: This is the best course of action.
ja: これこそが最善策だ。

source: •Content — what we write or otherwise express via the web — must be subject to design thinking and, in fact, all other design decisions should facilitate that.
ja: • コンテンツ（書く、あるいは別の方法で、Webを介して表現しようとする内容）はデザイン思考に基づいている必要があり、デザインに関する他のあらゆる決断はそれを促進するものでなければならない。

source: •Web pages are not immutable artifacts.
ja: • Webページは不変のものではない。

source: They should be tolerant of changing, dynamic content.
ja: 変化する動的なコンテンツに対応できなければならない。

source: This content should be managed in terms of discrete components which can be reused as agreed patterns.
ja: また、このコンテンツは決まったパターンとして再利用できる個々のコンポーネントとして管理されなければならない。

source: •The potential audience of a website or app is anyone human.
ja: • Webやアプリケーションの潜在ユーザーはあらゆる人間である。

source: Inclusivity of ability, preference and circumstance is paramount.
ja: インクルーシブな機能、パフォーマンス、環境は最重要課題だ。

source: Where people differ — and they always do — inclusive interfaces are robust interfaces.
ja: 人は皆それぞれ違うので、インクルーシブなインターフェイスこそが確実なインターフェイスと言える。

source: Inclusive Design
ja: インクルーシブデザイン

source: For the subject and purpose of this particular book, that last principle is the most important.
ja: 特に本書では、そのテーマと目的から考えると、最後の原則が一番重要になります。

source: Before we can contemplate inclusive patterns, inclusive design must first be defined.
ja: インクルーシブパターンについて考察するためには、まずはじめにインクルーシブデザインとはどういうものかを定義しておく必要があります。

source: It’s really more of a mindset than anything reducible to discrete skills, so I’m going to illustrate it by way of an analogy.
ja: 個々のスキルに分解できるものではなく考え方の問題であるため、身近な例にたとえて説明しましょう。

source: Here’s a property representing a street address in JSON:
ja: このプロパティはJSONのもので、住所を表しています。

source: Now, if I wanted to print the address to screen using a templating library like Handlebars, I might write something like {{this.address}}.
ja: この住所をHandlebarsのようなテンプレートライブラリを使って画面に出力したい場合は、{{this.address}}などと記述します。

source: Fine, but what if I needed to refer to the country part of my address on its own?
ja: では、住所の国の部分だけを参照したいときはどうすればよいでしょう？

source: With the data in its current form — one string — I’d have to write a helper to extract the “United States” part.
ja: この形式のデータ、つまり単一の文字列の場合は、たとえばヘルパーを使って「United States」を抽出するという方法が考えられます。

source: This is what some might refer to as hacky: a fragile and unfortunately complex workaround.
ja: しかし、この方法は人によってはハック的なやり方に思われるかもしれません。脆弱な上に複雑で、最善の策とは言えないかもしれません。

source: A hack is a symptom of bad design.
ja: ハック的なコードは悪いデザインの兆候です。

source: Not only is the employment of a helper function relatively computationally heavy, it’s also unreliable.
ja: ヘルパー関数を使うと計算が重くなるだけでなく、信頼性も下がります。

source: Why? Because not all addresses end in a country.
ja: なぜなら、住所は必ずしも国で終わるとは限らないからです。

source: British addresses, for instance, usually end in a postcode:
ja: たとえばイギリスの住所は普通、郵便番号が最後にきます。

source: A more robust solution might be to make the address property an object and store each part of the address as a property on that object:
ja: そうすると、住所のプロパティをオブジェクトに変えて、そのオブジェクトに住所の各部分をプロパティとして格納する方がより確実かもしれません。

source: Now I can access the country simply with address.country.
ja: これならaddress.countryで国にアクセスできます。

source: This seems like a better approach.
ja: やり方としてはこちらの方が良いように思えます。

source: But is it?
ja: でも、本当にそうでしょうか？

source: Using a hugely international set of addresses, you’ll find they vary so much that prescribing an unbending set of properties is just not tenable.
ja: 住所は国によってまったく違います。

source: Simply capturing a single string makes more sense. You’d have to forfeit being able to extract countries, but sometimes that’s the way it goes.
ja: 世界各国の住所で試してみると、融通のきかないプロパティセットではとても対応できないことが分かります。単純に単一の文字列をキャプチャした方が賢明です。国の抽出はできなくなるかもしれませんが、場合によってはそれも仕方ありません。

source: In any case, thinking about the structure of data and trying to arrive at an optimal solution is designing and there’s not an Adobe license or copy of Sketch in sight.
ja: いずれにしても、このようにデータの構造を考え、最適な解決策を導き出そうとすることこそがデザインであり、そこにはAdobeのライセンスやSketchのコピーは一切関係ありません。

source: In fact, it’s really a kind of inclusive design: here, the right solution is one which is inclusive of different kinds of addresses.
ja: そして、この例の正しい解決策は、さまざまなタイプの住所を含めることができる方法であり、それがまさしくインクルーシブデザインというものなのです。

source: We’d like to be able to deal with consistent, uniform addresses, but that’s not reality.
ja: 住所の方に一貫性を持たせることができればいいのですが、それは現実的ではありません。

source: Instead, we make allowances.
ja: 代わりに「許容」するのです。

source: Replace “structure of data” with “interface” and swap “addresses” for “people” in the previous paragraph, and you’ve got inclusive interface design in a nutshell.
ja: そして、前の段落の「データの構造」を「インターフェイス」に、「住所」を「人々」に置き換えると、いわゆるインクルーシブインターフェイスデザインになります。

source: The best part is that designing inclusive interfaces, like designing robust data schemas, doesn’t have to be any harder or more complex than making exclusive or otherwise obsolete ones.
ja: 幸い、インクルーシブなインターフェイスをデザインするのは堅牢なデータスキーマをデザインするのと似ており、排他的なインターフェイスや時代遅れのインターフェイスを作るより難しかったり複雑だとは限りません。

source: It’s just different.
ja: 単に違うというだけのことです。

source: By looking at common web interface patterns through the lens of inclusivity, this book will help you quickly learn how to apply and reapply conventions that will earn you a broader and less frustrated audience.
ja: 一般的なWebインターフェイスのパターンをインクルーシビティという観点で見ながら本書を読めば、きっとすぐに慣習を適用・応用して閲覧者を増やしたり、閲覧者のフラストレーションを軽減できるようになるでしょう。

source: The Inclusive Button
ja: インクルーシブなボタン

source: Let’s look at one more simple example, a prototypical interface pattern much like those to follow.
ja: 次の例はさらにシンプルな、模範とすべき典型的なインターフェイスパターンです。

source: This time, we’ll look at an interactive element, a button, from the perspectives of three types of designer.
ja: インタラクティブ要素であるボタンを、3タイプのデザイナーの視点で見てみましょう。

source: The purpose of this example is to show you how a little bit of knowledge about the medium can lead to a simpler and more inclusive solution.
ja: この例の目的は、このメディアに関する少しの知識があれば、よりシンプルでよりインクルーシブな解決策を導き出すことができるということを、皆さんに知ってもらうことです。

source: The Graphic Designer
ja: グラフィックデザイナー

source: The first designer comes from a graphic design background.
ja: トップバッターは、グラフィックデザインの分野のデザイナーです。

source: Their files never have a resolution lower than 300dpi and they have a working knowledge of color theory.
ja: 彼らは常に解像度300dpi以上のファイルを扱い、色彩理論の実際的な知識を持っています。

source: Their typography and illustration skills are vivacious.
ja: また、タイポグラフィとイラストに関するスキルも豊富です。

source: To them, a button is a visual artifact, producible in Adobe Illustrator or Sketch.
ja: 彼らにとってボタンは視覚的な要素であり、AdobeのIllustratorやSketchで作るものです。

source: They are concerned with how that button resembles a real button and how it simultaneously fits into the larger design’s branding.
ja: 彼らの関心は、いかに本物のボタンのように見えるか、そしてより大きなデザインのブランディングにいかにフィットしているかということに向けられます。

source: They have no idea how to put that button on a web page or to make it do anything.
ja: そのボタンをどうやってWebページに実装するか、どうやって動作させるかはまったく考えていません。

source: The Designer Who Codes
ja: コードを書くデザイナー

source: The second designer has many of the same skills exhibited by the first, but differs in one important aspect: they have enough knowledge of HTML, CSS and JavaScript to make their button appear inside a web page, and attach a JavaScript event listener to it.
ja: 2番目のデザイナーも最初のデザイナーと同じスキルに長けていますが、1つ大きな違いがあります。それは、彼らはHTML、CSS、JavaScriptの知識が豊富で、ボタンをWebページ内に表示させたり、ボタンにJavaScriptのイベントリスナーをアタッチしたりできるという点です。

source: The HTML looks like this:
ja: HTMLは次のようになります。

source: and the CSS like this:
ja: CSSは次のようになります。

source: The JavaScript would probably be written using jQuery or perhaps AngularJS’s API.
ja: JavaScriptはおそらくjQueryやAngularJSのAPIを使って書くことが多いでしょう。

source: Using the Web API (“vanilla” JavaScript), it might look a bit like this:
ja: Web API（“Vanilla” JavaScript）を使用した場合はだいたい次のようになります。

source: button.addEventListener('click', function() { // the event fired on click });
ja: button.addEventListener('click', function() {V // クリックでイベント発火 });

source: Designer number two is a designer who has learned to code inasmuch as they’ve acquired the ability to bring their ideas to the web — to put them in web pages.
ja: この2番目のデザイナーはアイデアをWebに生かす、つまりWebページに実装できるくらいのコードの知識は持っており、状況によってはイレギュラーなユーザーにも対応できます。

source: Under some circumstances, they may even work for the odd user. Unfortunately, aside from the event listener, all they’re really doing is encoding graphic design, not designing with code.
ja: しかし残念ながら、イベントリスナーは別としても、彼らが実際にやっているのはコードを用いたデザインではなく、グラフィックデザインをコード化することです。

source: As the third designer is only too aware, there are few direct translations between graphic design and web interface design.
ja: しかし3番目のデザイナーは、グラフィックデザインとWebインターフェイスデザインとの間には直接的な変換がほとんど成り立たないことをよく知っています。

source: The Inclusive Designer
ja: インクルーシブデザイナー

source: The third designer sees the second designer’s button from a number of perspectives, each the imagined point of view of a potential user.
ja: 3番目のデザイナーは2番目のデザイナーのボタンを、潜在ユーザーを想定してさまざまな観点から検討します。

source: Accordingly, the current implementation presents a number of problems.
ja: そうすると、現行の実装の問題点が次々と見えてきます。

source: One problem regards the not insignificant number of users who zoom their web pages to ease reading.
ja: 1つの問題は、Webページを見やすいように拡大／縮小するユーザーに関することです。このようなユーザーは少なくありません。

source: The image used is not a vector, so cannot be scaled without becoming degraded and blurry as a result.
ja: 使用する画像はベクターではないため、画像のサイズを変えるとどうしても画質が下がり、ぼやけてしまいます。

source: That’s if the user operates full page zoom.
ja: ただし、これはユーザーがページ全体を拡大／縮小した場合の話です。

source: If the user adjusts their browser’s default font size independently, the image (which has been defined using pixels rather than relative units) will not scale at all.
ja: ブラウザのデフォルトのフォントサイズをユーザーが自分で調整しても、画像（相対的な単位ではなく、ピクセルを使って定義されている画像）のサイズは変わりません。

source: Another problem is encountered when a user switches off image loading in their mobile browser, to save bandwidth: the button, constituted entirely by a background image, will be invisible.
ja: もう1つの問題は、モバイルブラウザで帯域幅を節約するために、画像の読み込みをオフにした場合に起こります。画像の読み込みをオフにすると、背景画像だけで作られたボタンは表示されなくなります。

source: Users having trouble differentiating foreground and background imagery may turn on Windows’ high contrast mode1.
ja: また、前景と背景の画像がよく区別できないユーザーは、Windowsのハイコントラストモード（脚注1）をオンにするかもしれません。

source: This, under some conditions, will also eliminate background images2.
ja: この場合も、条件によっては背景の画像が表示されなくなります。（脚注2）

source: And it doesn’t stop there.
ja: 問題は他にもあります。

source: The <div> element, unlike the purpose-built <button> element, is not (in its current form) focusable or operable by keyboard.
ja: ボタン専用の<button>要素と違って、<div>要素は（現行の形式では）キーボードでフォーカスしたり操作したりできません。

source: Some folks choose to navigate and operate web pages with a keyboard.
ja: しかし、Webページの移動や操作にキーボードを使う人もいます。

source: Others must use a keyboard, because a mouse requires a finer motor control than they can muster.
ja: また、マウス派の人でも、マウスでは対応できないより細かいコントロールが必要なときにはキーボードを使わなければなりません。

source: Screen reader users include those with severe vision impairments, and others who find that having a web page read out to them using a synthetic voice aids their comprehension.
ja: スクリーンリーダーユーザーには、重度の視力障害のある人だけでなく、分かりやすいように敢えて合成音声を使ってWebページを読み上げるユーザーもいます。

source: The second designer’s button design leaves these users entirely bereft.
ja: 2番目のデザイナーのボタンデザインでは、こうしたユーザーのことはまったく考えられていません。

source: Most desktop screen reader users are also keyboard users, so they encounter the same problems as the previous group.
ja: また、デスクトップスクリーンリーダーのユーザーのほとんどはキーボードも使用するため、前述した問題も生じます。

source: In addition, the <div> element is semantically inert, offering no information non-visually that it is, indeed, a button.
ja: さらに、<div>要素には特別な意味はなく、ボタンのような情報を非視覚的に提供することはできません。

source: Since the button’s label of “Start” is in a background image as part of CSS’s presentation layer, this too is unavailable to assistive technologies.
ja: 背景画像のボタンの場合、たとえば「スタート」というラベルはCSSのプレゼンテーション層に含まれるため、これもやはり支援技術には使えません。

source: It’s also why the button is untranslatable into different languages, making it exclude international audiences.
ja: また同じ理由から、ボタンを別の言語に翻訳できないため、世界中のユーザーに対応することができません。

source: That’s a lot of people missing out!
ja: かなり多くの人が機会を逃しているということです！

source: The inclusive designer anticipates these problems, because experience tells them that people differ, well, in lots of different ways.
ja: しかし、インクルーシブなデザイナーならこうした問題を予測できます。経験上、人は同じでないこと、しかもその違いも実にさまざまであることを知っているからです。

source: Far from being daunted or frustrated, they know that by exploiting standard conventions they can achieve more by doing less.
ja: しかし、その事実に気後れしたり挫折したりはしません。一般的な慣習を利用すれば、より少ない労力でより多くの成果が得られることを彼らは知っています。

source: In other words, they know when to design and when to employ what is already designed — a simple HTML button element, provided as standard by the HTML specification.
ja: つまり、デザインをすべきときと、既存のデザイン（HTMLの仕様で標準として示されているシンプルなHTMLボタン要素など）を使用すべきときが分かっているのです。

source: Resizable, translatable, focusable, interoperable, stylable, restylable, maintainable, mutable, simple.
ja: サイズが変えられて、翻訳可能で、フォーカスできて、相互運用性が高く、スタイルの指定や変更ができて、管理が可能で、変更可能で、そしてシンプルなデザイン。

source: <button>Start</button>
ja: <button>スタート</button>

source: Not all inclusive design solutions are as simple as choosing the right HTML element for the job.
ja: もちろん、目的に合ったHTML要素を選びさえすれば必ずインクルーシブデザインになるというわけではありません。

source: Even so, combining simple, standard elements and conventional structures empathetically needn’t be difficult, nor impede artistic flair: our <button> can still be presented in a near-infinite number of ways.
ja: それでも、シンプルかつスタンダードな要素と慣習的な構造を組み合わせるのはそう難しいことではありませんし、見た目の美しさを邪魔するものでもありません。<button>の記述パターンはほぼ無限に考えられます。

source: “There are 140,737,479,966,720 combinations of hexcodes.
ja: 「16進コードの組み合わせは140,737,479,966,720通りあります。

source: Obviously not all of them are accessible.
ja: もちろん、そのすべてを使用できるわけではありません。

source: If only 1% of all color combinations are accessible then there are still almost 141 million combinations to choose from.
ja: しかし、たとえばすべての色の組み合わせのわずか1％しか使用できないとしても、およそ1億4千百万通りの組み合わせから選べることになります。

source: This seems more than adequate to paint any bikeshed you will come across for the rest of your career.” – “The Veil Of Ignorance3,” Adam Morse
ja: ？？これから先のキャリアで出くわす自転車置き場をすべて塗っても余るほどです」？？【コメント：不安訳です。原文「This seems more than adequate to paint any bikeshed you will come across for the rest of your career.」】— 「The Veil Of Ignorance」、アダム・モース（Adam Morse）（脚注3）

source: With experience, identifying the countless inclusive solutions to interface design problems can become second nature.
ja: 経験を積むうちに、おのずとインターフェイスデザインの課題に対する、無数に考えられるインクルーシブな解決策を特定できるようになっていきます。

source: The patterns described in this book are reusable as exemplars, but mostly they’re for practice.
ja: 本書で取り上げるパターンは手本にはなりますが、基本的には練習用です。

source: When new problems arise, requiring different inclusive patterns to be formulated, you will have learned how to think about formulating them.
ja: 新たな問題が生じたときは、別のインクルーシブパターンを考えなければなりません。大丈夫、皆さんもきっとできるようになるはずです。

source: You will have become an inclusive designer.
ja: そうなれば、一人前のインクルーシブデザイナーです。

source: 1.http://windows.microsoft.com/en-US/windows7/Turn-on-High-Contrast 2.http://terrillthompson.com/blog/182 3.http://mrmrs.io/writing/2016/03/23/the-veil-of-ignorance/
ja: 1 http://smashed.by/hicontrast 2 http://terrillthompson.com/blog/182 3 http://mrmrs.io/writing/2016/03/23/the-veil-of-ignorance/
